CSI API ETABS v1
eShellType Enumeration
 The possible shell types.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public enum eShellType
Public Enumeration eShellType
Dim instance As eShellType
public enum class eShellType
type eShellType
Members
Member name | Value | Description
ShellThin | 1
ShellThick | 2
Membrane | 3
PlateThin_DO_NOT_USE | 4
PlateThick_DO_NOT_USE | 5
Layered | 6
Remarks
See Also
Reference
ETABSv1 Namespace